NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B420F2048IQ64.svd
        <register>
          <name>DCDCSYNC</name>
          <description>DCDC Read Status Register</description>
          <addressOffset>0x078</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DCDCCTRLBUSY</name>
              <description>DCDC CTRL Register Transfer Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONAVDDCTRL</name>
          <description>VMON AVDD Channel Control</description>
          <addressOffset>0x090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFF0D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLTHRESFINE</name>
              <description>Falling Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLTHRESCOARSE</name>
              <description>Falling Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISETHRESFINE</name>
              <description>Rising Threshold Fine Adjust</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISETHRESCOARSE</name>
              <description>Rising Threshold Coarse Adjust</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONALTAVDDCTRL</name>
          <description>Alternate VMON AVDD Channel Control</description>
          <addressOffset>0x094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF0D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONDVDDCTRL</name>
          <description>VMON DVDD Channel Control</description>
          <addressOffset>0x098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF0D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONIO0CTRL</name>
          <description>VMON IOVDD0 Channel Control</description>
          <addressOffset>0x09C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF1D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RETDIS</name>
              <description>EM4 IO0 Retention Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONIO1CTRL</name>
          <description>VMON IOVDD1 Channel Control</description>
          <addressOffset>0x0A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF1D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RETDIS</name>
              <description>EM4 IO1 Retention Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONBUVDDCTRL</name>
          <description>VMON BUVDD Channel Control</description>
          <addressOffset>0x0A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF0D</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RISEWU</name>
              <description>Rise Wakeup</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALLWU</name>
              <description>Fall Wakeup</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESFINE</name>
              <description>Threshold Fine Adjust</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESCOARSE</name>
              <description>Threshold Coarse Adjust</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM1CTRL</name>
          <description>Memory Control Register</description>
          <addressOffset>0x0B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>RAMPOWERDOWN</name>
              <description>RAM1 Blockset Power-down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None of the RAM blocks powered down</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK7</name>
                  <description>Power down RAM block 7 (address range 0x2003C000-0x2003FFFF)</description>
                  <value>0x00000080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK6TO7</name>
                  <description>Power down RAM blocks 6-7 (address range 0x20038000-0x2003FFFF)</description>
                  <value>0x000000C0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK5TO7</name>
                  <description>Power down RAM blocks 5-7 (address range 0x20034000-0x2003FFFF)</description>
                  <value>0x000000E0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK4TO7</name>
                  <description>Power down RAM blocks 4-7 (address range 0x20030000-0x2003FFFF)</description>
                  <value>0x000000F0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK3TO7</name>
                  <description>Power down RAM blocks 3-7 (address range 0x2002C000-0x2003FFFF)</description>
                  <value>0x000000F8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK2TO7</name>
                  <description>Power down RAM blocks 2-7 (address range 0x20028000-0x2003FFFF)</description>
                  <value>0x000000FC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK1TO7</name>
                  <description>Power down RAM blocks 1-7 (address range 0x20024000-0x2003FFFF)</description>
                  <value>0x000000FE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO7</name>
                  <description>Power down RAM blocks 0-7 (address range 0x20020000-0x2003FFFF)</description>
                  <value>0x000000FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM2CTRL</name>
          <description>Memory Control Register</description>
          <addressOffset>0x0B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>RAMPOWERDOWN</name>
              <description>RAM2 Blockset Power-down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None of the RAM blocks powered down</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK3</name>
                  <description>Power down RAM block 3</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK2TO3</name>
                  <description>Power down RAM blocks 2-3</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK1TO3</name>
                  <description>Power down RAM blocks 1-3</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK0TO3</name>
                  <description>Power down RAM blocks 0-3</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BUCTRL</name>
          <description>Backup Power Configuration Register</description>
          <addressOffset>0x0BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80333307</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable Backup Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STATEN</name>
              <description>Enable Backup Mode Status Export</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUVINPROBEEN</name>
              <description>Enable BU_VIN Probing</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOUTRES</name>
              <description>BU_VOUT Resistor Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>BU_VOUT is not connected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEAK</name>
                  <description>Enable weak switch between BU_VOUT and backup domain power supply.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Enable medium switch between BU_VOUT and backup domain power supply.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STRONG</name>
                  <description>Enable strong switch between BU_VOUT and backup domain power supply.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRRES</name>
              <description>Power Domain Resistor Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES0</name>
                  <description>Main power and backup power connected with RES0 series resistance.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1</name>
                  <description>Main power and backup power connected with RES1 series resistance.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES2</name>
                  <description>Main power and backup power connected with RES2 series resistance.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES3</name>
                  <description>Main power and backup power connected with RES3 series resistance.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUACTPWRCON</name>
              <description>Power Connection Configuration in Backup Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No connection.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAINBU</name>
                  <description>Main power and backup power are connected through a diode, allowing current to flow from backup power source to main power source, but not the other way.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUMAIN</name>
                  <description>Main power and backup power are connected through a diode, allowing current to flow from main power source to backup power source, but not the other way.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NODIODE</name>
                  <description>Main power and backup power are connected without diode.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUINACTPWRCON</name>
              <description>Power Connection Configuration When Not in Backup Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No connection.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAINBU</name>
                  <description>Main power and backup power are connected through a diode, allowing current to flow from main power source to backup power source, but not the other way.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUMAIN</name>
                  <description>Main power and backup power are connected through a diode, allowing current to flow from backup power source to main power source, but not the other way.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NODIODE</name>
                  <description>Main power and backup power are connected without diode.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISMAXCOMP</name>
              <description>Disable MAIN-BU Comparator</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
